{
    "Depression": {
      "multiplier": 2,
      "ranges": [
        { "min": 0, "max": 9, "label": "Normal", "description": "Your mood appears stable. Keep practicing positive habits." },
        { "min": 10, "max": 13, "label": "Mild Depression", "description": "You might be experiencing low mood. Monitor your feelings and consider self-care strategies." },
        { "min": 14, "max": 20, "label": "Moderate Depression", "description": "You may benefit from talking to a counselor or a trusted person." },
        { "min": 21, "max": 27, "label": "Severe Depression", "description": "Professional mental health support is strongly recommended." },
        { "min": 28, "max": 100, "label": "Extremely Severe Depression", "description": "It is crucial to seek immediate help from a mental health professional." }
      ]
    },
    "Anxiety": {
      "multiplier": 2,
      "ranges": [
        { "min": 0, "max": 7, "label": "Normal", "description": "You're showing no signs of clinical anxiety. Keep managing stress effectively." },
        { "min": 8, "max": 9, "label": "Mild Anxiety", "description": "You might experience occasional anxious thoughts. Relaxation techniques may help." },
        { "min": 10, "max": 14, "label": "Moderate Anxiety", "description": "Consider stress management or talking to a support system." },
        { "min": 15, "max": 19, "label": "Severe Anxiety", "description": "It may be beneficial to consult a therapist or counselor." },
        { "min": 20, "max": 100, "label": "Extremely Severe Anxiety", "description": "Please consider seeking professional help to manage your anxiety." }
      ]
    },
    "Stress": {
      "multiplier": 2,
      "ranges": [
        { "min": 0, "max": 14, "label": "Normal", "description": "You’re experiencing low levels of stress. Keep up the healthy habits!" },
        { "min": 15, "max": 18, "label": "Mild Stress", "description": "Try incorporating mindfulness or physical activity into your routine." },
        { "min": 19, "max": 25, "label": "Moderate Stress", "description": "Talking to a friend or using relaxation strategies can help." },
        { "min": 26, "max": 33, "label": "Severe Stress", "description": "It's important to take steps to reduce stress. Professional advice can be helpful." },
        { "min": 34, "max": 100, "label": "Extremely Severe Stress", "description": "Immediate stress management support is highly recommended." }
      ]
    },
    "Happiness": {
      "multiplier": 1,
      "postProcess": "divideBy15",
      "ranges": [
        {
          "min": 0,
          "max": 2.0,
          "label": "Feeling Low",
          "description": "It’s okay to have tough days. Try focusing on small moments of joy or talking to someone you trust."
        },
        {
          "min": 2.1,
          "max": 3.0,
          "label": "Doing Okay",
          "description": "You're holding up. Consider doing things that make you smile — a walk, a chat, or your favorite hobby."
        },
        {
          "min": 3.1,
          "max": 4.0,
          "label": "Generally Happy",
          "description": "You seem to be in a positive space! Keep embracing the things and people that lift your spirits."
        },
        {
          "min": 4.1,
          "max": 6.5,
          "label": "Feeling Great",
          "description": "That’s wonderful to see! You're radiating good vibes — spread the positivity and keep doing what works for you!"
        }
      ]
    },
    "Social Support": {
      "multiplier": 1,
      "postProcess": "divideBy12",
      "ranges": [
        {
          "min": 0,
          "max": 1.0,
          "label": "Low Social Support",
          "description": "It seems like you may be feeling isolated. It might help to reach out to family, friends, or a professional to build a stronger support network."
        },
        {
          "min": 1.1,
          "max": 2.0,
          "label": "Below Average Support",
          "description": "You may have some support, but there could be room for improvement. Consider connecting with others more often."
        },
        {
          "min": 2.1,
          "max": 3.0,
          "label": "Average Social Support",
          "description": "You seem to have a decent support system. Remember, it's always helpful to keep those connections strong and reach out when needed."
        },
        {
          "min": 3.1,
          "max": 4.0,
          "label": "Strong Social Support",
          "description": "You have a solid support network, which can help you navigate tough situations. It's great to maintain these healthy connections."
        }
      ]
    },
    "Resilience": {
      "multiplier": 1,
      "ranges": [
        { "min": 4, "max": 10, "label": "Low Resilience", "description": "You may struggle to cope with setbacks. It might help to practice stress management techniques." },
        { "min": 11, "max": 15, "label": "Below Average Resilience", "description": "You may bounce back from some challenges but might benefit from building more coping strategies." },
        { "min": 16, "max": 20, "label": "Average Resilience", "description": "You handle stress reasonably well but may still face difficulties in challenging times." },
        { "min": 21, "max": 25, "label": "High Resilience", "description": "You have strong resilience and bounce back effectively from challenges." }
      ]
    },

"Relationship": {
    "multiplier": 1,
    "ranges": [
      { "min": 0, "max": 6, "label": "Unhealthy Relationship", "description": "The relationship may be struggling. It might be helpful to address the issues and consider open communication." },
      { "min": 7, "max": 13, "label": "Below Average Relationship", "description": "There are challenges in the relationship. Working on trust and communication can help improve the situation." },
      { "min": 14, "max": 18, "label": "Relatively Healthy Relationship", "description": "The relationship is relatively healthy. Continue to nurture trust, respect, and open communication." },
      { "min": 19, "max": 21, "label": "Harmonious Relationship", "description": "The relationship is strong and harmonious. Maintain the positive aspects that make the relationship work well." }
    ]
  },

"Self-Esteem": {
  "multiplier": 1,
  "ranges": [
    {
      "min": 36,
      "max": 40,
      "label": "Low Self-Esteem",
      "description": "You may have a negative self-view or feel dissatisfied with yourself. Consider practicing self-compassion and seeking support to boost your self-worth."
    },
    {
      "min": 31,
      "max": 35,
      "label": "Below Average Self-Esteem",
      "description": "You may doubt your abilities at times, but with effort and self-care, you can strengthen your confidence."
    },
    {
      "min": 26,
      "max": 30,
      "label": "Average Self-Esteem",
      "description": "You have a fairly balanced view of yourself, but you might still have some areas to work on. Keep building your confidence!"
    },
    {
      "min": 21,
      "max": 25,
      "label": "Healthy Self-Esteem",
      "description": "You generally feel good about yourself. Keep nurturing your self-worth and focusing on your strengths."
    },
    {
      "min": 10,
      "max": 20,
      "label": "High Self-Esteem",
      "description": "You have a strong sense of self-worth and confidence. Continue embracing your strengths and maintaining a positive outlook on yourself."
    }
  ]
},

"Loneliness": {
    "multiplier": 1,
    "postProcess": "divideBy60",
    "ranges": [
      {
        "min": 0,
        "max": 0.5,
        "label": "Low Loneliness",
        "description": "You seem to have a good level of social connection. Keep nurturing your relationships."
      },
      {
        "min": 0.6,
        "max": 1.5,
        "label": "Moderate Loneliness",
        "description": "You may feel lonely at times. Consider reaching out to others to strengthen your connections."
      },
      {
        "min": 1.6,
        "max": 2.5,
        "label": "High Loneliness",
        "description": "You seem to experience significant loneliness. It could be helpful to seek support or engage in social activities."
      },
      {
        "min": 2.6,
        "max": 3.0,
        "label": "Very High Loneliness",
        "description": "It seems like you're feeling isolated and disconnected. Reaching out for support could be beneficial."
      }
    ]
  }

}
  